
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       8 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                    |
|:--------:|:-----------------------------------------------------------------------------|
|    🟢     | `aws_iam_role_policy_attachment.ecs-tester-service-network-permissions`      |
|    🟢     | `aws_iam_role_policy_attachment.ecs-tester-website-pod-permissions`          |
|    🟢     | `module.ecs-tester.aws_iam_policy.pytest-permissions`                        |
|    🟢     | `module.ecs-tester.aws_iam_policy.role-permissions`                          |
|    🟢     | `module.ecs-tester.aws_iam_role.role-tester`                                 |
|    🟢     | `module.ecs-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢     | `module.ecs-tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢     | `module.ecs-tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/6c4c86c5-ef9e-4fcb-ade7-106f4140544e/terraform-bin plan -no-color --out=tf.plan
aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]
aws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-permissions: Reading...
data.aws_iam_policy_document.service-network-tester-permissions: Reading...
data.aws_iam_policy_document.gha-admin-tester-permissions: Reading...
data.aws_iam_policy_document.jumphost-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]
data.aws_iam_policy_document.website-pod-tester-permissions: Reading...
data.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]
data.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]
data.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]
data.aws_iam_policy_document.omnibus-assume: Reading...
data.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]
data.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=3750070676]
data.aws_iam_policy_document.pytest-permissions: Reading...
module.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...
aws_iam_policy.jumphost-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions]
module.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Reading...
aws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...
aws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]
aws_iam_role.omnibus: Refreshing state... [id=omnibus]
aws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]
data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]
module.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...
aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.ecs-tester.data.aws_iam_policy_document.role-permissions: Reading...
data.aws_iam_policy.read-only-access: Reading...
module.ecs-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]
module.ecs-tester.data.aws_iam_policy.administrator-access: Reading...
module.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...
aws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]
module.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...
module.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]
data.aws_iam_policy.administrator-access: Reading...
module.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]
module.github-role-tester.data.aws_iam_policy.administrator-access: Reading...
aws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]
aws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]
module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
aws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]
module.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]
module.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...
module.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=2420075302]
module.ecs-tester.data.aws_iam_openid_connect_provider.github: Reading...
module.ecs-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...
module.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]
aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]
module.ecs-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]
data.aws_iam_policy.read-only-access: Read complete after 1s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]
module.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.debian-repo-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231109161344894400000002]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]
module.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...
module.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]
aws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]
aws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]
module.debian-repo-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/debian-repo-tester-permissions20231109161344894400000001]
module.ecs-tester.data.aws_iam_policy_document.role-trust: Reading...
module.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]
module.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...
module.ecs-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=869017062]
module.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]
data.aws_iam_policy_document.jumphost-tester-assume: Reading...
data.aws_iam_policy_document.website-pod-tester-assume: Reading...
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
data.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]
data.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]
data.aws_iam_policy_document.gha-admin-tester-assume: Reading...
data.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]
data.aws_iam_policy_document.service-network-tester-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-assume: Reading...
data.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]
module.debian-repo-tester.aws_iam_role.role-tester: Refreshing state... [id=debian-repo-tester]
data.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]
module.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...
aws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]
aws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]
aws_iam_role.jumphost-tester: Refreshing state... [id=jumphost-tester]
aws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]
aws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]
aws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]
module.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=debian-repo-tester-20231109161345692400000004]
module.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=debian-repo-tester-20231109161345698500000005]
aws_iam_role_policy_attachment.jumphost-tester: Refreshing state... [id=jumphost-tester-20231101163151291300000001]
aws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231101163151292000000002]
aws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]
aws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]
aws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]
aws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]
aws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]
aws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]
module.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]
module.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]
aws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]
aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]
data.aws_iam_policy_document.omnibus-permissions: Reading...
module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...
module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
data.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]
aws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]
aws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]
module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]
module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.ecs-tester-service-network-permissions will be created
  + resource "aws_iam_role_policy_attachment" "ecs-tester-service-network-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions"
      + role       = "ecs-tester"
    }

  # aws_iam_role_policy_attachment.ecs-tester-website-pod-permissions will be created
  + resource "aws_iam_role_policy_attachment" "ecs-tester-website-pod-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/website-pod-tester-permissions"
      + role       = "ecs-tester"
    }

  # module.ecs-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pytest-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ecs-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ecs-tester-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ecs-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-ecs:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-ecs"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "ecs-tester"
    }

  # module.ecs-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-tester"
    }

  # module.ecs-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-tester"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=3750070676]%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_policy.jumphost-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions]%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Aaws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Adata.aws_iam_policy.read-only-access: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=2420075302]%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Adata.aws_iam_policy.read-only-access: Read complete after 1s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Amodule.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.debian-repo-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231109161344894400000002]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Amodule.debian-repo-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/debian-repo-tester-permissions20231109161344894400000001]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=869017062]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]%0Adata.aws_iam_policy_document.jumphost-tester-assume: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-assume: Reading...%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Adata.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]%0Adata.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Amodule.debian-repo-tester.aws_iam_role.role-tester: Refreshing state... [id=debian-repo-tester]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Amodule.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Aaws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.jumphost-tester: Refreshing state... [id=jumphost-tester]%0Aaws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=debian-repo-tester-20231109161345692400000004]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=debian-repo-tester-20231109161345698500000005]%0Aaws_iam_role_policy_attachment.jumphost-tester: Refreshing state... [id=jumphost-tester-20231101163151291300000001]%0Aaws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231101163151292000000002]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]%0Aaws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]%0Aaws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role_policy_attachment.ecs-tester-service-network-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs-tester-service-network-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions"%0A      + role       = "ecs-tester"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs-tester-website-pod-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs-tester-website-pod-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::303467602807:policy/website-pod-tester-permissions"%0A      + role       = "ecs-tester"%0A    }%0A%0A  # module.ecs-tester.aws_iam_policy.pytest-permissions will be created%0A  + resource "aws_iam_policy" "pytest-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "pytest-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutBucketTagging",%0A                          + "s3:GetBucketTagging",%0A                          + "iam:TagRole",%0A                          + "iam:TagPolicy",%0A                          + "ec2:DescribeRegions",%0A                          + "dynamodb:TagResource",%0A                          + "dynamodb:ListTagsOfResource",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.ecs-tester.aws_iam_policy.role-permissions will be created%0A  + resource "aws_iam_policy" "role-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ecs-tester-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.ecs-tester.aws_iam_role.role-tester will be created%0A  + resource "aws_iam_role" "role-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-ecs:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module infrahouse/terraform-aws-ecs"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ecs-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "ecs-tester"%0A    }%0A%0A  # module.ecs-tester.aws_iam_role_policy_attachment.role-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ecs-tester"%0A    }%0A%0A  # module.ecs-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ecs-tester"%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC82YzRjODZjNS1lZjllLTRmY2ItYWRlNy0xMDZmNDE0MDU0NGUvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5hd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXVxuYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwMjg1MDY1NzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4MzcwMDUxNDBdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTAxNTA5MDcyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3NTAwNzA2NzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3BvbGljeS5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2p1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uc11cbm1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3BvbGljeS53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cbmF3c19pYW1fcm9sZS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzXVxuYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF1cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxMzM4NDE3NzVdXG5tb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl1cbm1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dXG5tb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdXG5tb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzY3MzQ1NDAxXVxubW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3BvbGljeS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM0MTg3NTEwNjldXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fcG9saWN5LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3N0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnNdXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbmF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5XVxuYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11dzE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5hd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdXG5tb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5jaV9jZF9pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNDIwMDc1MzAyXVxubW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLlxubW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fcG9saWN5LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2doYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnNdXG5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXVxubW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9SZWFkT25seUFjY2Vzc11cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEwODAwMzk0NjAyODcwMDAwMDAwMl1cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEwOTE2MTM0NDg5NDQwMDAwMDAwMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZ2l0aHViLXJvbGUtdGVzdGVyLXBlcm1pc3Npb25zMjAyMzExMDgwMDU5NDQxMjMyMDAwMDAwMDFdXG5tb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3MzY0OTIxNTldXG5hd3NfaWFtX2FjY2Vzc19rZXkudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBVU5LQVVFTjMySVdLUlNFWl1cbmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lci0yMDIzMDcwMTE4MDAzMTA4NDcwMDAwMDAwMV1cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZGViaWFuLXJlcG8tdGVzdGVyLXBlcm1pc3Npb25zMjAyMzExMDkxNjEzNDQ4OTQ0MDAwMDAwMDFdXG5tb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LTIwMjMwODExMTgwNjM1MDg0MDAwMDAwMDAxXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi5cbm1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODY5MDE3MDYyXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1OTY5OTA3ODFdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE0NzQ0OTY4NV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI3NjQ5NjA0NV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMDY1NzE3MzldXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTg1MTA4Nzg4XVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlcl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbC0yMDIzMDYzMDAzMDgwMzk2MTIwMDAwMDAwMV1cbmF3c19pYW1fcm9sZS53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjg3NzUyMjcxXVxuYXdzX2lhbV9yb2xlLmp1bXBob3N0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyXVxuYXdzX2lhbV9yb2xlLmdoYS1hZG1pbi10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXJdXG5hd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl1cbmF3c19pYW1fcm9sZS5zdGF0ZS1idWNrZXQtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlci0yMDIzMTEwOTE2MTM0NTY5MjQwMDAwMDAwNF1cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlci0yMDIzMTEwOTE2MTM0NTY5ODUwMDAwMDAwNV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTEwMTE2MzE1MTI5MTMwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdC10ZXN0ZXItYWRtaW4tcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTEwMTE2MzE1MTI5MjAwMDAwMDAwMl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMwNzAzMTk0MjI1Mjg3NjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMxMDA5MjAzMTI0ODQyODAwMDAwMDAyXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3Rlci1zZXJuaXZlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjE3MjkwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjI2NzIwMDAwMDAwMl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MTkzNDM0Njk3MTAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdoYS1hZG1pbi10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MjAzMTI0ODY2MTAwMDAwMDAzXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlci0yMDIzMTEwODAxMDgyMjgzMDAwMDAwMDAwM11cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlci0yMDIzMTEwODAxMDgyMjc3MTgwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MjAzMDI0MjQ0NDAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MTk1MjAxNzAxNTAwMDAwMDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTIzNTg3ODA2XVxuYXdzX2lhbV9wb2xpY3kub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvb21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfYWNsLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZSxwdWJsaWMtcmVhZF1cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU3MDUzOTEyOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVjcy10ZXN0ZXItc2VydmljZS1uZXR3b3JrLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJlY3MtdGVzdGVyLXNlcnZpY2UtbmV0d29yay1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc1wiXG4gICAgICArIHJvbGUgICAgICAgPSBcImVjcy10ZXN0ZXJcIlxuICAgIH1cblxuICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5lY3MtdGVzdGVyLXdlYnNpdGUtcG9kLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJlY3MtdGVzdGVyLXdlYnNpdGUtcG9kLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS93ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnNcIlxuICAgICAgKyByb2xlICAgICAgID0gXCJlY3MtdGVzdGVyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwicHl0ZXN0LXBlcm1pc3Npb25zXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdSb2xlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUG9saWN5XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpUYWdSZXNvdXJjZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6TGlzdFRhZ3NPZlJlc291cmNlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJlY3MtdGVzdGVyLXBlcm1pc3Npb25zXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwic3RzOkdldENhbGxlcklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwicm9sZS10ZXN0ZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1lY3M6KlwiXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgRmVkZXJhdGVkID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21cIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIHRlc3QgbW9kdWxlIGluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1lY3NcIlxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImVjcy10ZXN0ZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLWFkbWluLXBlcm1pc3Npb25zWzBdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLWFkbWluLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwiZWNzLXRlc3RlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImVjcy10ZXN0ZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1weXRlc3QtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImVjcy10ZXN0ZXJcIlxuICAgIH1cblxuUGxhbjogOCB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdJTBBYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MDI4NTA2NTc2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI0NzkzODQ4NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODM3MDA1MTQwXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTAxNTA5MDcyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNzUwMDcwNjc2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3BvbGljeS53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV0lMEFhd3NfaWFtX3JvbGUub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1c10lMEFhd3NfaWFtX3JvbGUuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2xdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzEzMzg0MTc3NV0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3BvbGljeS5Ud2luREJUZXN0UnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9Ud2luREJUZXN0UnVubmVyXSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM2NzM0NTQwMV0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNDE4NzUxMDY5XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFhd3NfaWFtX3BvbGljeS5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQWF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5XSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdXcxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0Lm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFhd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuY2lfY2RfaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNjc5MDA4Mk9VMFBPUFdPQ1BaNF0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNDIwMDc1MzAyXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2lhbV9wb2xpY3kuZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFhd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9SZWFkT25seUFjY2Vzc10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzExMDgwMDM5NDYwMjg3MDAwMDAwMDJdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEwOTE2MTM0NDg5NDQwMDAwMDAwMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9naXRodWItcm9sZS10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEwODAwNTk0NDEyMzIwMDAwMDAwMV0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNzM2NDkyMTU5XSUwQWF3c19pYW1fYWNjZXNzX2tleS50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUFVTktBVUVOMzJJV0tSU0VaXSUwQWF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lci0yMDIzMDcwMTE4MDAzMTA4NDcwMDAwMDAwMV0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2RlYmlhbi1yZXBvLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTA5MTYxMzQ0ODk0NDAwMDAwMDAxXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS0yMDIzMDgxMTE4MDYzNTA4NDAwMDAwMDAwMV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODY5MDE3MDYyXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTk2OTkwNzgxXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTQ3NDQ5Njg1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI3NjQ5NjA0NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAwNjU3MTczOV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUxMDg3ODhdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlcl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTIzNTg5NTA5XSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItcm9sZS10ZXN0ZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2wtMjAyMzA2MzAwMzA4MDM5NjEyMDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlLndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjg3NzUyMjcxXSUwQWF3c19pYW1fcm9sZS5qdW1waG9zdC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuZ2hhLWFkbWluLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlci0yMDIzMTEwOTE2MTM0NTY5MjQwMDAwMDAwNF0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kZWJpYW4tcmVwby10ZXN0ZXItMjAyMzExMDkxNjEzNDU2OTg1MDAwMDAwMDVdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyLTIwMjMxMTAxMTYzMTUxMjkxMzAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdC10ZXN0ZXItYWRtaW4tcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTEwMTE2MzE1MTI5MjAwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMDcwMzE5NDIyNTI4NzYwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NDI4MDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3Rlci1zZXJuaXZlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjE3MjkwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzA4MTMxNjI2MjIyNjcyMDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdoYS1hZG1pbi10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEwMDkxOTM0MzQ2OTcxMDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdoYS1hZG1pbi10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MjAzMTI0ODY2MTAwMDAwMDAzXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItcm9sZS10ZXN0ZXItMjAyMzExMDgwMTA4MjI4MzAwMDAwMDAwMDNdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyNzcxODAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MjAzMDI0MjQ0NDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlci0yMDIzMTAxNTE5NTIwMTcwMTUwMDAwMDAwMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyMzU4NzgwNl0lMEFhd3NfaWFtX3BvbGljeS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9vbW5pYnVzMjAyMzA3MjkwNDI0MzE5OTkyMDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X2FjbC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUscHVibGljLXJlYWRdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3BvbGljeS5wdWJsaWMtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi0yMDIzMDcwMjE1Mjc0ODY0NjQwMDAwMDAwMV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVjcy10ZXN0ZXItc2VydmljZS1uZXR3b3JrLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZWNzLXRlc3Rlci1zZXJ2aWNlLW5ldHdvcmstcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyByb2xlICAgICAgID0gXCJlY3MtdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWNzLXRlc3Rlci13ZWJzaXRlLXBvZC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImVjcy10ZXN0ZXItd2Vic2l0ZS1wb2QtcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvd2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIHJvbGUgICAgICAgPSBcImVjcy10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcInB5dGVzdC1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0QnVja2V0VGFnZ2luZ1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUm9sZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdQb2xpY3lcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6VGFnUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpMaXN0VGFnc09mUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiZWNzLXRlc3Rlci1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpHZXRDYWxsZXJJZGVudGl0eVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInJvbGUtdGVzdGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWVjczoqXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIHRlc3QgbW9kdWxlIGluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1lY3NcIiUwQSAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDAlMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiZWNzLXRlc3RlclwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtYWRtaW4tcGVybWlzc2lvbnNbMF0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLWFkbWluLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NcIiUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiZWNzLXRlc3RlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJlY3MtdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXB5dGVzdC1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiZWNzLXRlc3RlclwiJTBBICAgIH0lMEElMEFQbGFuOiA4IHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogOCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>